Repository: afandos-bbm/fan2dev_app_flutter
Catalog: lib/l10n/arb/app_*.arb
Languages: ca

# error_generic
source: An error occurred
ca: S'ha produït un error

# footer_text
source: fan2dev. All rights reserved.
ca: fan2dev. Tots els drets reservats.

# login_email
source: Email
ca: Correu electrònic

# login_password
source: Password
ca: Contrasenya

# menu_projects
source: Projects
ca: Projectes

# menu_about
source: About
ca: Quant a

# menu_contact
source: Contact
ca: Contacte

# contact_title
source: Send me your message!
ca: Envia'm el teu missatge!

# contact_subtitle
source: Hello! If you have questions, proposals, or just want to share your ideas, I'm ready to listen. Fill out the form below. Looking forward to your message! ðŸ“¬
ca: Hola! Si tens preguntes, propostes o simplement vols compartir les teves idees, estic llest per escoltar-te. Completa el formulari a continuació. Espero el teu missatge! 📬

# contact_name
source: Name
ca: Nom

# contact_email
source: Email
ca: Correu electrònic

# contact_message
source: Message
ca: Missatge

# contact_send
source: Send
ca: Enviar

# contact_success_title
source: Thank you for your message!
ca: Gràcies pel teu missatge!

# contact_success_subtitle
source: I will reply to you as soon as possible.
ca: Et respondré tan aviat com siga possible.

# contact_success_button
source: Back to the site
ca: Torna al lloc web

# contact_error_empty_message
source: This field is empty
ca: Aquest camp està buit

# contact_error_invalid_email
source: Invalid email
ca: Correu electrònic no vàlid

# settings_title
source: Settings
ca: Configuració

# settings_language
source: Language
ca: Idioma

# settings_language_en
source: English
ca: Anglès

# settings_language_es
source: Spanish
ca: Espanyol

# settings_language_va
source: Valencian
ca: Valencià

# settings_theme
source: Theme
ca: Tema

# settings_theme_light
source: Light
ca: Clar

# settings_theme_dark
source: Dark
ca: Fosc

# settings_theme_system
source: System
ca: Sistema

# settings_privacy_policy
source: Privacy Policy
ca: Política de privacitat

# settings_notifications
source: Notifications
ca: Notificacions

# settings_notifications_enabled
source: {enabled, select, true{Enabled} false{Disabled} other{Unknown}}
ca: {enabled, select, true{Activat} false{Desactivat} other{Desconegut}}

# about_title
source: Hi, my name is Alejandro Fandos
ca: Hola, em dic Alejandro Fandos

# about_sort_description
source: I am passionate software developer crafting digital solutions. Let's turn ideas into innovation together.
ca: Sóc un apassionat desenvolupador de programari que crea solucions digitals. Convertim idees en innovació junts.

# about_text_1
source: With a fervent passion for turning conceptual ideas into tangible, high-quality software, I've spent over four years honing my craft. My journey in the ever-evolving world of coding has equipped me with not only technical expertise but also a commitment to understanding and exceeding client expectations. I believe in the power of innovation and continuous learning, and I bring this mindset to every project I undertake.
ca: Amb una passió fervent per convertir idees conceptuals en programari tangible i de alta qualitat, he passat més de quatre anys perfeccionant el meu ofici. La meva trajectòria en el món sempre canviant de la programació m'ha dotat no només d'experiència tècnica, sinó també d'un compromís per comprendre i superar les expectatives del client. Crec en el poder de la innovació i l'aprenentatge continu, i aplico aquesta mentalitat a cada projecte que emprenc.

# about_text_2
source: I bring a diverse set of skills to the table, specializing in technologies such as Flutter, AstroJS, JavaScript, Tailwind, NodeJS, and leveraging tools like Git, GitHub Actions, and Docker. My proficiency extends to crafting cross-platform applications and dynamic web solutions. With a knack for problem-solving and an eye for detail, I thrive on delivering efficient and impactful software solutions tailored to meet your unique needs.
ca: Aporto un conjunt divers de habilitats a la taula, especialitzant-me en tecnologies com Flutter, AstroJS, JavaScript, Tailwind, NodeJS, i utilitzant eines com Git, GitHub Actions i Docker. La meva competència s'estén a la creació d'aplicacions multiplataforma i solucions web dinàmiques. Amb habilitat per resoldre problemes i atenció al detall, prospero en l'entrega de solucions de programari eficients i impactants dissenyades per satisfer les seves necessitats úniques.

# about_text_3
source: Beyond the screen, I am a person of varied interests. When not immersed in code, you might find me exploring the outdoors, capturing moments through photography, or delving into the world of literature. I'm a firm believer in maintaining a healthy work-life balance, and my hobbies play a crucial role in keeping my creativity and problem-solving skills sharp. Whether it's a coding challenge or a hiking trail, I approach every endeavor with enthusiasm and a desire to learn.
ca: Més enllà de la pantalla, sóc una persona d'interessos variats. Quan no estic immers en codi, podries trobar-me explorant la natura, capturant moments a través de la fotografia o submergint-me en el món de la literatura. Crec fermament en mantenir un equilibri saludable entre el treball i la vida, i els meus passatemps juguen un paper crucial per mantenir aguda la meva creativitat i les meves habilitats per resoldre problemes. Ja sigui un repte de codificació o un sender de senderisme, abordo cada empresa amb entusiasme i un desig d'aprendre.

# privacy_policy_title
source: Privacy Policy
ca: Política de privacitat

source: Error loading privacy policy
ca: S'ha produït un error en carregar la política de privacitat

# projects_title
source: Projects
ca: Projectes

# projects_subtitle
source: Here are some of the projects I've worked on. Click on the cards to learn more about each one.
ca: Ací tens alguns dels projectes en els quals he treballat. Fes clic en les targetes per a obtindre més informació sobre cadascun.

# projects_status
source: {status, select, development{Development} soon{Soon} finished{Finished} other{Other}}
ca: {status, select, development{Desenvolupament} soon{Pronte} finished{Finalitzat} other{Un altre}}

# projects_time_expended
source: Time expended:
ca: Temps invertit:

# projects_open_website
source: Open website
ca: Obrir lloc web

# projects_open_repository
source: Open code repository
ca: Obrir repositori de codi

# projects_details_screenshots
source: Screenshots
ca: Captures de pantalla

# projects_details_technologies
source: Technologies
ca: Tecnologies

# info_no_data
source: No data available
ca: No hi ha dades per mostrar

# ob_welcome_title
source: Welcome to my app!
ca: Benvingut a la meua aplicació!

# ob_welcome_subtitle
source: I'm excited to have you here. Let's get started!
ca: Estic emocionat de tenir-te ací! Comencem!

# ob_welcome_disclaimer
source: Remember that we have support for multiple languages and themes, and support for IOS, Android, and Web.
ca: Recorda que tenim suport per a múltiples idiomes i temes, i suport per a IOS, Android i Web.

# ob_posts_title
source: Multiple sections
ca: Múltiples seccions

# ob_posts_subtitle
source: Blog, projects, about, and contact sections. All in one place.
ca: Seccions de blog, projectes, sobre i contacte. Tot en un sol lloc.

# ob_notifications_title
source: Stay informed
ca: Mantén-te informat

# ob_notifications_subtitle
source: Receive notifications about new posts, projects, and updates.
ca: Rebre notificacions sobre noves publicacions, projectes i actualitzacions.

# ob_notifications_disclaimer
source: You can enable or disable notifications in the settings section.
ca: Pots habilitar o deshabilitar les notificacions a la secció de configuració.

# ob_notifications_button
source: Enable notifications
ca: Activar notificacions
